<script>
	import Error from '$lib/components/error.svelte';

	function showMsg() {
		alert(`Короче, хакер, я тебя вычислил и в благородство играть не буду: 
расскажешь об ошибке – и мы в расчете. Заодно посмотрим, как быстро у тебя башка после изучения API прояснится.

А по твоей теме постараюсь разузнать. Хрен его знает, на кой ляд тебе этот сайт сдался, но я в чужие дела не лезу, хочешь взломать, значит есть за что…
        `);
	}
</script>

<Error imgURL="400.jpg" code="HTTP/4xx" short="странный запрос">
	<div style="font-weight: bold;">Тут может быть два варианта:</div>
	<div>1. Я накосячил и вы попали в просак (извините).</div>
	<div>2. Вы сами знаете как тут оказались.</div>
	<p />
	<div style="font-weight: bold;">Если у вас первый вариант, выберите одно из двух:</div>
	<div>1. Написать мне о том, как вы тут оказались.</div>
	<div>2. Просто вернуться на главную.</div>
	<p />
	<div style="font-weight: bold;">Если у вас второй вариант:</div>
	<div>1. Нажмите <i on:click={showMsg} style="color: red;">сюда</i>.</div>
</Error>
